novaeco/simulrepile/firmware/sdkconfig.defaults
# Core target configuration
CONFIG_IDF_TARGET="esp32s3"
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MEMMAP=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_BANKSWITCH_ENABLE=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# Logging and debugging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_CONSOLE_USB_CDC=y

# LVGL & graphics defaults
CONFIG_LV_CONF_SKIP=y
CONFIG_LVGL_TICK_CUSTOM=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_MEM_CUSTOM=y

# Storage / SD
CONFIG_SDMMC_HOST_DEFAULT_SPEED=y
CONFIG_SDMMC_USE_1LINE_MODE=y

# Application defaults (Kconfig symbols defined in Kconfig file)
CONFIG_APP_MAX_TERRARIUMS=4
CONFIG_APP_AUTOSAVE_INTERVAL_S=120
CONFIG_APP_ENABLE_COMPRESSION=n
CONFIG_APP_ENABLE_WIFI_OTA=n
CONFIG_APP_ENABLE_TTS_STUB=n
CONFIG_APP_LANG_DEFAULT="fr"
CONFIG_APP_THEME_HIGH_CONTRAST=y
CONFIG_BSP_SD_BUS_WIDTH_1BIT=y
CONFIG_BSP_USB_CAN_SELECTABLE=y
